# Scripts to Test Warehouse Summary Data
## Peter Stoermer

In [1]:
# Libraries
import pandas as pd
import numpy as np

### Files Needed For Script to Run
1. 7-SI & 13-SI
2. 7-SV & 13-SV
3. 7-ON & 13-ON
4. 7-SI-INV & 13-SI-INV
5. 7-SV-INV & 13-SV-INV
6. 7-ON-INV & 13-ON-INV
7. Inventory Report for Audit

#### Methodology
The AIMS sales and inventory data gets appended together to make one large data set for each warehouse. Pivot tables are done on that new large dataset to find *sales* and *inventory* figures by date (instruction how to convert invoice date to month is shown below). Once we isolate month I ran pivot tables on the files using month as the index with the different values we needed. Once those isolated dataframes are ran I combinded them and took totals both across rows and down columns. From there I apply the same logic to combine the inventory data from the three warehouses. I then find the total space and units from that data for the summary of the data when it is pulled (thus the date_time cell). To find the amount and space of product going out, I merged the inventory audit data and the combinded sales data to form a master dataframe (this part was difficult because there is not one unique identifier for the products, so I had to make one using both the product stlye and color to find how much space "CBM" is used for each product). From there I ran another pivot table for both CBM and CBF by month. 

Once all of the dataframes are together, I wrote a function that could write all of the dataframes to a single sheet in an excel file so it can be shared, worked on and viewed easily.

### SI Sales Data
The first step is to get the information for both 7 & 13. I then combined them using an *.append()* method because both flat-files have the same structure. Once all of the data is collected I ouput the pivot table looking at the sales data. These are the major steps needed.
1. Gather AIMS Data
2. Using the #-WH file make a new "month" column
 - in Exel use *=MONTH(invdate)*
3. Use the pivot tables I made using the Pandas python library

In [2]:
si7_p = r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(7-SI).xlsx'
df = pd.read_excel(si7_p)
df.head()

,division,linecode,style,color,desc,catcode,upcno,shptot,price,amount,...,order,entered,month,edifile,note1,ststate,stzip,piktkt,piktktdate,ediitem
0,D,EC,EB197,BNI,SglHdlBatroom Faucet,NaN,92903951541,1,81.89,81.89,...,816949,18-Apr-22,4,NaN,NaN,ON,K2E 1C5,812467,18-Apr-22,EB197
1,D,EC,EB197,BNI,SglHdlBatroom Faucet,NaN,92903951541,1,81.89,81.89,...,817355,03-May-22,5,NaN,NaN,ON,K2E 1C5,812835,03-May-22,EB197
2,D,EC,EB197,BNI,SglHdlBatroom Faucet,NaN,92903951541,3,81.89,245.67,...,817476,09-May-22,5,NaN,NaN,ON,K2E 1C5,812955,09-May-22,EB197
3,D,EC,EB197,BNI,SglHdlBatroom Faucet,NaN,92903951541,1,81.89,81.89,...,817573,11-May-22,5,NaN,NaN,ON,K2E 1C5,813044,11-May-22,EB197
4,D,EC,EB197,BNI,SglHdlBatroom Faucet,NaN,92903951541,2,81.89,163.78,...,819630,22-Jul-22,7,NaN,NaN,ON,K2E 1C5,815063,22-Jul-22,EB197

In [3]:
# test = df.pivot_table(index=['month'], values=['amount'], aggfunc='sum')
# print(test)

In [4]:
si13_p =  r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(13-SI).xlsx'
df_2 = pd.read_excel(si13_p)
df_2.head()

,division,linecode,style,color,desc,catcode,upcno,shptot,price,amount,...,month,order,entered,edifile,note1,ststate,stzip,piktkt,piktktdate,ediitem
0,A,IL,CE97011C,BLK,Amelie LED Desk Lamp,NaN,92903943454,4,28.5,114.0,...,1,131567,01-Jan-22,ss0103o.2ac,NaN,NS,B4N 3E6,129119,03-Jan-22,2997313
1,A,IL,CE97011C,BLK,Amelie LED Desk Lamp,NaN,92903943454,4,28.5,114.0,...,1,131555,30-Dec-21,ss0103o.2aa,NaN,ON,K6H 6R3,129107,03-Jan-22,2997313
2,A,IL,CE97011C,BLK,Amelie LED Desk Lamp,NaN,92903943454,4,28.5,114.0,...,1,131558,30-Dec-21,ss0103o.2aa,NaN,ON,K8P 5L2,129110,03-Jan-22,2997313
3,A,IL,CE97011C,BLK,Amelie LED Desk Lamp,NaN,92903943454,4,28.5,114.0,...,1,131563,31-Dec-21,ss0103o.2ab,NaN,ON,K9J 3R8,129115,03-Jan-22,2997313
4,A,IL,CE97011C,BLK,Amelie LED Desk Lamp,NaN,92903943454,4,28.5,114.0,...,1,131557,30-Dec-21,ss0103o.2aa,NaN,AB,T6N 1K1,129109,03-Jan-22,2997313

In [5]:
si_data = df.append(df_2)
#df_3.to_excel("yuwrong.xlsx")

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [6]:
si_sales_data = si_data.pivot_table(index=['month'], values=['amount'], aggfunc='sum', margins=True)
si_sales_data = si_sales_data.rename(columns={'amount':'si_sales'})

si_sales_data

        si_sales
month
1       87044.98
2      116577.85
3      185044.41
4       54819.43
5      131119.51
6       99001.17
7       94188.89
8      103340.02
9       23641.62
All    894777.88

### SI Inventory Data

In [7]:
si_inventory_data = si_data.pivot_table(index=['month'], values=['shptot'], aggfunc='sum', margins=True)
si_inventory_data = si_inventory_data.rename(columns={'shptot':'si_inv'})

si_inventory_data

       si_inv
month
1        3014
2        3508
3        5468
4        1039
5        1873
6        1149
7        1892
8        2172
9         481
All     20596

### ON Sales Data

In [8]:
on7_p = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(7-ON).xlsx')
on13_p = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(13-ON).xlsx')
on_data = on7_p.append(on13_p)
#all_data.to_excel("Chekc.xlsx")
on_sales_data = on_data.pivot_table(index=['month'], values=['amount'], aggfunc='sum', margins=True)
on_sales_data = on_sales_data.rename(columns={'amount':'on_sales'})

on_sales_data

         on_sales
month
1       543840.26
2       662820.98
3       376896.87
4       366437.41
5       107552.70
6       423283.87
7       918518.20
8      2807595.56
9       341555.86
All    6548501.71

### ON Inventory Data

In [9]:
on_inventory_data = on_data.pivot_table(index=['month'], values=['shptot'], aggfunc='sum', margins=True)
on_inventory_data = on_inventory_data.rename(columns={'shptot':'on_inv'})

on_inventory_data

        on_inv
month
1       157621
2       153773
3        69874
4       104702
5        28082
6        87036
7       139083
8       427753
9        71018
All    1238942

### SV Sales Data

In [10]:
sv7_p = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(7-SV).xlsx')
sv13_p = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Test(13-SV).xlsx')
sv_data = sv7_p.append(sv13_p, sort=True)
sv_sales_data = sv_data.pivot_table(index=['month'], values=['amount'], aggfunc='sum', margins=True)
sv_sales_data = sv_sales_data.rename(columns={'amount':'sv_sales'})

sv_sales_data

         sv_sales
month
1      118941.780
2      184252.446
3      152082.980
4      178057.890
5       44729.910
6       18858.240
7       61741.450
8       24628.340
9       32604.790
All    815897.826

### SV Inventory Data

In [11]:
sv_inventory_data = sv_data.pivot_table(index=['month'], values=['shptot'], aggfunc='sum', margins=True)
sv_inventory_data = sv_inventory_data.rename(columns={'shptot':'sv_inv'})

sv_inventory_data

       sv_inv
month
1       33647
2       54684
3       14572
4       32796
5        2662
6         383
7         987
8         420
9         884
All    141035

## Merged Dataframes (Sales)

In [12]:
all_sales = pd.concat([sv_sales_data, si_sales_data, on_sales_data], axis=1, join='inner')
all_sales = all_sales.eval('All = si_sales + on_sales + sv_sales')
print(all_sales)

         sv_sales   si_sales    on_sales          All
month
1      118941.780   87044.98   543840.26   749827.020
2      184252.446  116577.85   662820.98   963651.276
3      152082.980  185044.41   376896.87   714024.260
4      178057.890   54819.43   366437.41   599314.730
5       44729.910  131119.51   107552.70   283402.120
6       18858.240   99001.17   423283.87   541143.280
7       61741.450   94188.89   918518.20  1074448.540
8       24628.340  103340.02  2807595.56  2935563.920
9       32604.790   23641.62   341555.86   397802.270
All    815897.826  894777.88  6548501.71  8259177.416

## Merged DataFrames (Inventory)

In [13]:
all_inv = pd.concat([sv_inventory_data, si_inventory_data, on_inventory_data], axis=1, join='inner')
all_inv = all_inv.eval('All = sv_inv + si_inv + on_inv')
print(all_inv)

       sv_inv  si_inv   on_inv      All
month
1       33647    3014   157621   194282
2       54684    3508   153773   211965
3       14572    5468    69874    89914
4       32796    1039   104702   138537
5        2662    1873    28082    32617
6         383    1149    87036    88568
7         987    1892   139083   141962
8         420    2172   427753   430345
9         884     481    71018    72383
All    141035   20596  1238942  1400573

## Append 13 + 7 Files for Inventory Data (Date by Warehouse Data)
We are not going to be able to run all of the historic data but we will be able to append both of the charts with cubic (using on_cubic, si_cubic, sv_cubic). Number of units is (on, si, sv). This code uses very similar path structure because all of the data pulled from AIMS is in the same *Raw Files* Folder.

In [14]:
#### Number of Units ON ####
on_13_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\13-ON-Inv.xls')
on_7_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\7-ON-Inv.xls')
on_units = on_13_inv.append(on_7_inv)
on_units_sum = on_units['on'].sum()
print(f' Total sum of units in ON warehouse: {on_units_sum}')

 Total sum of units in ON warehouse: 1029987

In [15]:
#### Number of Units SI ####
si_13_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\13-SI-Inv.xls')
si_7_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\7-SI-Inv.xls')
si_units = si_13_inv.append(si_7_inv)
si_units_sum = si_units['si'].sum()
print(f' Total sum of units in SI warehouse: {si_units_sum}')

 Total sum of units in SI warehouse: 48015

In [16]:
#### Number of Units SV ####
sv_13_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\13-SV-Inv.xls')
sv_7_inv = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\7-SV-Inv.xls')
sv_units = sv_13_inv.append(sv_7_inv)
sv_units_sum = sv_units['sv'].sum()
print(f' Total sum of units in SV warehouse: {sv_units_sum}')

 Total sum of units in SV warehouse: 28508

In [17]:
#### Final Output for Section ####
units_series = [[pd.Timestamp.today(), "Units", on_units_sum, si_units_sum, sv_units_sum]]
units = pd.DataFrame(units_series)
#pd.pivot(units, values=['on_units_sum', 'sv_units_sum', 'si_units_sum'])
#units.reset_index(drop=True)
units.columns = ['Date', 'Units', 'ON', 'SI', 'SV']
units["All"] = units.sum(axis=1)
units

                        Date  Units       ON     SI     SV      All
0 2022-09-19 17:31:45.645493  Units  1029987  48015  28508  1106510

## Date by Warehouse Space

In [18]:
#### Space of Units ON ####
on_space = on_units
on_space_sum = round(on_space['on_cubic'].sum(), 2)
print(f' Total sum of units in ON warehouse: {on_space_sum}')

 Total sum of units in ON warehouse: 217848.25

In [19]:
#### Space of Units SI ####
si_space = si_units
si_space_sum = round(si_space['si_cubic'].sum(), 2)
print(f' Total sum of units in SI warehouse: {si_space_sum}')

 Total sum of units in SI warehouse: 33471.65

In [20]:
#### Space of Units SV ####
sv_space = sv_units
sv_space_sum = round(sv_space['sv_cubic'].sum(), 2)
print(f' Total sum of units in SV warehouse: {sv_space_sum}')

 Total sum of units in SV warehouse: 29051.24

In [21]:
#### Final Output for Section ####
space_series = [[pd.Timestamp.today(), "Cubic", on_space_sum, si_space_sum, sv_space_sum]]
space = pd.DataFrame(space_series)
#pd.pivot(units, values=['on_units_sum', 'sv_units_sum', 'si_units_sum'])
#units.reset_index(drop=True)
space.columns = ['Date', 'Cubic', 'ON', 'SI', 'SV']
space["All"] = space.sum(axis=1)
space

                        Date  Cubic         ON        SI        SV        All
0 2022-09-19 17:31:45.823539  Cubic  217848.25  33471.65  29051.24  280371.14

## CBF & CBM
We are using the inventory data for this section (for SI (7-SI-Inv & 13-SI-Inv)). They are already combined so all we have to do is isolate the columns for the appropriate information. The formula for cubic ft is $CBF = cubic \, ft / master * (on/si/sv)$. To get meters the formula is $CBM=CBF/35.3$

In [22]:
# NOTES: I have to change the first row to lower case in order to join both of the df's together to get month and CBM data
inv_report = pd.read_excel(r'C:\Users\Peter Stoermer\OneDrive - Enchante Living\Documents\Joint_Project_Test\Copy of Inventory Report - For Audit - September 12, 2022.xlsx', header=2)
inv_report.head()

,Division,Category,ID,Account,AIMS Data,AIMS Division,style,color,Type,Status,...,Less Than 3 Months,Over 3 Months,Over 6 Months,Over 9 Months,Over 12 Months,Less Than 3 Months Value ELC,Over 3 Months Value ELC,Over 6 Months Value ELC,Over 9 Months Value ELC,Over 12 Months Value ELC
0,Bathroom Acc,Bathroom Acc,30900121008,Alejandra,7,D,30900121,008,In-Line,Active,...,0,0,0,0,192,0.0,0.0,0.0,0.0,456.96
1,Bathroom Acc,Bathroom Acc,30900131008,Alejandra,7,D,30900131,008,In-Line,Active,...,0,0,0,0,360,0.0,0.0,0.0,0.0,583.20
2,Bathroom Acc,Bathroom Acc,30900141008,Alejandra,7,D,30900141,008,In-Line,Active,...,0,0,0,0,336,0.0,0.0,0.0,0.0,635.04
3,Bathroom Acc,Bathroom Acc,30900151020,Alejandra,7,D,30900151,020,In-Line,Active,...,0,0,0,0,0,0.0,0.0,0.0,0.0,0.00
4,Bathroom Acc,Bathroom Acc,30900191029,Alejandra,7,D,30900191,029,In-Line,Active,...,0,0,0,0,0,0.0,0.0,0.0,0.0,0.00

#### SI CBM & CBF

In [25]:
si_data = si_data.merge(inv_report, on=['style', 'color'], suffixes=('_left', '_right'))

In [26]:
si_data['total_cbm'] = si_data['CRTN CBM_left']/si_data["Casepack_left"]*si_data["shptot"]
cbm_si = si_data.pivot_table(index=['month'], values=['total_cbm'], aggfunc='sum', margins=True)
cbm_si = cbm_si.rename(columns={'total_cbm':'SI_CBM'})
print(cbm_si)

           SI_CBM
month
1       59.934292
2       56.665978
3       58.309853
4       31.691858
5       76.212056
6       59.716477
7       42.976303
8       47.751611
9        9.586623
All    442.845051

In [27]:
si_data['total_cbf'] = si_data['total_cbm']*35.3
cbf_si = si_data.pivot_table(index=['month'], values=['total_cbf'], aggfunc='sum', margins=True)
cbf_si = cbf_si.rename(columns={'total_cbf':'SI_CBF'})
print(cbf_si)

          SI_CBF
month
1       1.697855
2       1.605268
3       1.651837
4       0.897786
5       2.158982
6       1.691685
7       1.217459
8       1.352737
9       0.271576
All    12.545186

#### SV CBM & CBF

In [30]:
sv_data = sv_data.merge(inv_report, on=['style', 'color'], suffixes=('_left', '_right'))

In [31]:
sv_data['total_cbm'] = sv_data['CRTN CBM_left']/sv_data["Casepack_left"]*sv_data["shptot"]
cbm_sv = sv_data.pivot_table(index=['month'], values=['total_cbm'], aggfunc='sum', margins=True)
cbm_sv = cbm_sv.rename(columns={'total_cbm':'SV_CBM'})
print(cbm_sv)

           SV_CBM
month
1      186.636151
2      194.920804
3       11.143833
4       77.009970
5       36.260288
6        8.030804
7       69.538821
8       27.142892
9       10.211872
All    620.895436

In [32]:
sv_data['total_cbf'] = sv_data['total_cbm']*35.3
cbf_sv = sv_data.pivot_table(index=['month'], values=['total_cbf'], aggfunc='sum', margins=True)
cbf_sv = cbf_sv.rename(columns={'total_cbf':'SV_CBF'})
print(cbf_sv)

          SV_CBF
month
1       5.287143
2       5.521836
3       0.315689
4       2.181586
5       1.027204
6       0.227502
7       1.969938
8       0.768920
9       0.289288
All    17.589106

#### ON CBM & CBF

In [35]:
on_data = on_data.merge(inv_report, on=['style', 'color'], suffixes=('_left', '_right'))

In [36]:
on_data['total_cbm'] = on_data['CRTN CBM_left']/on_data["Casepack_left"]*on_data["shptot"]
cbm_on = on_data.pivot_table(index=['month'], values=['total_cbm'], aggfunc='sum', margins=True)
cbm_on = cbm_on.rename(columns={'total_cbm':'ON_CBM'})
print(cbm_on)

            ON_CBM
month
1       445.925279
2       478.917084
3       286.406390
4       270.243080
5        59.066849
6       222.433081
7       839.382980
8      2156.534036
9       314.669833
All    5073.578613

In [37]:
on_data['total_cbf'] = on_data['total_cbm']*35.3
cbf_on = on_data.pivot_table(index=['month'], values=['total_cbf'], aggfunc='sum', margins=True)
cbf_on = cbf_on.rename(columns={'total_cbf':'ON_CBF'})
print(cbf_on)

           ON_CBF
month
1       12.632444
2       13.567056
3        8.113495
4        7.655611
5        1.673282
6        6.301220
7       23.778555
8       61.091616
9        8.914160
All    143.727439

### Combine CBM & CBF Data Frames

In [38]:
### CBM SV, SI, ON

cbm = pd.concat([cbm_sv, cbm_si, cbm_on], axis=1, join='inner')
cbm = cbm.eval('All = SV_CBM + SI_CBM + ON_CBM')
print(cbm)

           SV_CBM      SI_CBM       ON_CBM          All
month
1      186.636151   59.934292   445.925279   692.495723
2      194.920804   56.665978   478.917084   730.503866
3       11.143833   58.309853   286.406390   355.860076
4       77.009970   31.691858   270.243080   378.944908
5       36.260288   76.212056    59.066849   171.539194
6        8.030804   59.716477   222.433081   290.180362
7       69.538821   42.976303   839.382980   951.898103
8       27.142892   47.751611  2156.534036  2231.428539
9       10.211872    9.586623   314.669833   334.468328
All    620.895436  442.845051  5073.578613  6137.319099

In [39]:
### CBF SV, SI, ON

cbf = pd.concat([cbf_sv, cbf_si, cbf_on], axis=1, join='inner')
cbf = cbf.eval('All =  SV_CBF + SI_CBF + ON_CBF')
print(cbf)

          SV_CBF     SI_CBF      ON_CBF         All
month
1       5.287143   1.697855   12.632444   19.617443
2       5.521836   1.605268   13.567056   20.694161
3       0.315689   1.651837    8.113495   10.081022
4       2.181586   0.897786    7.655611   10.734983
5       1.027204   2.158982    1.673282    4.859467
6       0.227502   1.691685    6.301220    8.220407
7       1.969938   1.217459   23.778555   26.965952
8       0.768920   1.352737   61.091616   63.213273
9       0.289288   0.271576    8.914160    9.475023
All    17.589106  12.545186  143.727439  173.861731

In [40]:
#### CBM & CBF for SI ####

si_units["cbf"] = si_units["cubic_ft"] / si_units["master_pack"] * si_units["si"]
si_cbf = round(si_units["cbf"].sum(), 2)
print(f"The total CBF for SI is: {si_cbf}")

print()

si_units["cbm"] = si_units["cubic_ft"] / si_units["master_pack"] * si_units["si"] / 35.3
si_cbm = round(si_units['cbm'].sum(), 2)
print(f"The total CBM for SI is: {si_cbm}")

The total CBF for SI is: 13767.79

The total CBM for SI is: 390.02

In [ ]:
#### CBM & CBF for ON ####

sv_units["cbf"] = sv_units["cubic_ft"] / sv_units["master_pack"] * sv_units["sv"]
sv_cbf = round(sv_units["cbf"].sum(), 2)
print(f"The total CBF for SV is: {sv_cbf}")

print()

sv_units["cbm"] = sv_units["cubic_ft"] / sv_units["master_pack"] * sv_units["sv"] / 35.3
sv_cbm = round(sv_units['cbm'].sum(), 2)
print(f"The total CBM for SV is: {sv_cbm}")

#### Keeping for Record

sales_master = sales.merge(inv_report, on=['style', 'color'], suffixes=('_left', '_right'))
sales_master['CRTN CBF'] = sales_master['CRTN CBM'].div(35.3)
sales_master.head()

#### Keeping for Record

cbm_month = sales_master.pivot_table(index=['month'], values=['CRTN CBM'], aggfunc='sum', margins=True) 
cbm_month

#### Keeping for Record

cbf_month = sales_master.pivot_table(index=['month'], values=['CRTN CBF'], aggfunc='sum', margins=True) 
cbf_month

In [ ]:
## Test for SI CBM & CBF

si_data['total_cbm'] = si_data['CRTN CBM_left']/si_data["Casepack_left"]*si_data["shptot"]
cbm_si = si_data.pivot_table(index=['month'], values=['total_cbm'], aggfunc='sum', margins=True)
cbm_si = cbm_si.rename(columns={'total_cbm':'SI_CBM'})
print(cbm_si)

### Testing Outputs

To test the outputs I am going to create an open file using a excel python package. It is easy to make each pivot table its own sheet in the excel workbook. I want to challenge myself and look into the documentation and see if there is a way to have it all work on one sheet (eliminating the chance for human error or incorrect reporting). **The below code works, search Formatting_Test.xlsx for the full workbook**

In [41]:
   #### function for excel file ####
def multiple_dfs(df_list, sheets, file_name, spaces):
        writer = pd.ExcelWriter(file_name,engine='xlsxwriter')   
        row = 0
        for dataframe in df_list:
            dataframe.to_excel(writer,sheet_name=sheets,startrow=row , startcol=2)   
            row = row + len(dataframe.index) + spaces + 1
        writer.save()

    ##### list of dataframes #####
dfs = [units, space, all_sales, all_inv, cbm, cbf]

    #### run function ####
multiple_dfs(dfs, 'Summary', 'Test_Final.xlsx', 1)